Revit 2027 API
FabricationHostedInfo.GetBearerCenterline Method
 Gets the centerline of the bearer. The method is applicable only for bearer hanger.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Line GetBearerCenterline()
Public Function GetBearerCenterline As Line
public:
Line^ GetBearerCenterline()
member GetBearerCenterline : unit -> Line
Return Value
Line
 The centerline of the bearer.
Exceptions
Exception | Condition
InvalidOperationException |  The hanger is not a bearer hanger.
See Also
Reference
FabricationHostedInfo Class
Autodesk.Revit.DB Namespace